dmoze/app/Models/ModelMenu.php

    public function dataMenu()
    {
        return $this->table('menu')
            ->join('kategori', 'menukategori=katid', 'left')
            ->get();
---
SELECT *
FROM `menu`
LEFT JOIN `kategori` ON `menukategori`=`katid`