dmoze/app/Models/ModelLevel.php

SELECT *
FROM `level`
LEFT JOIN `user` ON `levelid`=`userlevel`
GROUP BY `levelid`
---
    public function dataLevel()
    {
        return $this->table('level')
            ->join('user', 'levelid=userlevel', 'left')
            ->groupBy('levelid')
            ->get();