dmoze/app/Controllers/Auth.php

            } else {
                $modelUser  = new ModelUser();

                $cekUser = $modelUser->find($userid);
---
SELECT *
FROM `user`
WHERE `user`.`userid` = 'admin'