dmoze/app/Controllers/Home.php

    public function index(): string
    {
        $modelKategori = new ModelKategori();
        $modelMenu = new ModelMenu();

        $data = [
            'dataKategori'      => $modelKategori->findAll(),
            'dataMenu'          => $modelMenu->findAll(),
        ];
---
SELECT *
FROM `kategori`
SELECT *
FROM `menu`