dmoze/app/Controllers/Menu.php

    function formMenuEdit($menuid)
    {
        $modelMenu  = new ModelMenu();
        $cekData = $modelMenu->find($menuid);


        $modelKategori = new ModelKategori();

        $data = [
            'menuid'            => $cekData['menuid'],
            'menunama'          => $cekData['menunama'],
            'menukategori'      => $cekData['menukategori'],
            'menudeskripsi'     => $cekData['menudeskripsi'],
            'jenis_a'           => $cekData['jenis_a'],
            'harga_a'           => $cekData['harga_a'],
            'jenis_b'           => $cekData['jenis_b'],
            'harga_b'           => $cekData['harga_b'],
            'jenis_c'           => $cekData['jenis_c'],
            'harga_c'           => $cekData['harga_c'],
            'dataKategori'      => $modelKategori->findAll()
---
SELECT *
FROM `menu`
WHERE `menu`.`menuid` = '1'
SELECT *
FROM `kategori`