bamboodimsum/app/Models/ModelMenu.php

    public function dataMenu()
    {
        return $this->table('menu')
            ->join('pesanan', 'psn_menuid=menuid', 'left')
            ->groupBy('menuid', 'ASC')
            ->get();
---
SELECT *
FROM `menu`
LEFT JOIN `temp_pesanan` ON `temp_psn_menuid`=`menuid`
LEFT JOIN `det_pesanan` ON `det_psn_menuid`=`menuid`
GROUP BY `menuid`