bamboodimsum/app/Models/ModelKeranjang.php

SELECT *
FROM `keranjang`
LEFT JOIN `menu` ON `menuid`=`krn_menuid`
WHERE `krn_userid` = 'andi'
---
    public function dataKeranjang($userid)
    {
        return $this->table('keranjang')
            ->join('menu', 'menuid=krn_menuid', 'left')
            ->where('krn_userid', $userid)
            ->get();