bamboodimsum/app/Models/ModelPesanan.php

SELECT *
FROM `pesanan`
LEFT JOIN `menu` ON `menuid`=`psn_menuid`
WHERE `psn_userid` = 'andi'
---
    public function dataPesanan($userid)
    {
        return $this->table('pesanan')
            ->join('menu', 'menuid=psn_menuid', 'left')
            ->where('psn_userid', $userid)
            ->get();

SELECT *
FROM `pesanan`
LEFT JOIN `menu` ON `menuid`=`psn_menuid`
LEFT JOIN `user` ON `userid`=`psn_userid`
WHERE `psn_status` = 'Progress'
GROUP BY `psn_userid`
---
    public function daftarPesanan()
    {
        return $this->table('pesanan')
            ->join('menu', 'menuid=psn_menuid', 'left')
            ->join('user', 'userid=psn_userid', 'left')
            ->groupBy('psn_userid', 'Asc')
            ->where('psn_status', 'Progress')
            ->get();

SELECT *
FROM `pesanan`
LEFT JOIN `menu` ON `menuid`=`psn_menuid`
LEFT JOIN `user` ON `userid`=`psn_userid`
WHERE `psn_status` IN ('Pesanan diproses','Pesanan diantar')
GROUP BY `psn_userid`
---
    public function daftarPesananProses()
    {
        return $this->table('pesanan')
            ->join('menu', 'menuid=psn_menuid', 'left')
            ->join('user', 'userid=psn_userid', 'left')
            ->groupBy('psn_userid', 'Asc')
            ->whereIn('psn_status', ['Pesanan diproses', 'Pesanan diantar'])
            ->get();

SELECT *
FROM `pesanan`
LEFT JOIN `menu` ON `menuid`=`psn_menuid`
LEFT JOIN `user` ON `userid`=`psn_userid`
ORDER BY `psn_tanggal` DESC, `psn_id` ASC
---
    public function dataPesan()
    {
        return $this->table('pesanan')
            ->join('menu', 'menuid=psn_menuid', 'left')
            ->join('user', 'userid=psn_userid', 'left')
            ->orderby('psn_tanggal', 'Desc')
            ->orderby('psn_id', 'Asc')
            ->get();