gis/app/Controllers/Lokasi.php

    function formLokasiEdit($lokid)
    {

        $modelLokasi = new ModelLokasi();
        $cekData = $modelLokasi->find($lokid);
---
SELECT *
FROM `lokasi`
WHERE `lokasi`.`lokid` = '7'

    public function lokasiHapus($lokid)
    {
        $modelLokasi = new ModelLokasi();
        $modelLokasi->delete($lokid);
---
DELETE FROM `lokasi`
WHERE `lokid` IN ('8')

    function detailLokasi($lokid)
    {

        $modelLokasi = new ModelLokasi();
        $cekData = $modelLokasi->find($lokid);
---
SELECT *
FROM `lokasi`
WHERE `lokasi`.`lokid` = '7'