gis/app/Controllers/Main.php

    public function index()
    {
        $modelKategori = new ModelKategori();

        $data = [
            'menu'              => 'dashboard',
            'dataKategori'      => $modelKategori->findAll(),
---
SELECT *
FROM `kategori`