gis/app/Models/ModelLokasi.php

SELECT *
FROM `lokasi`
LEFT JOIN `data_intilejen` ON `intel_lokid`=`lokid`
---
    public function dataLokasi()
    {
        return $this->table('lokasi')
            ->join('data_intilejen', 'intel_lokid=lokid', 'left')
            ->get();