gis/app/Models/ModelIntelijen.php

SELECT *
FROM `data_intilejen`
LEFT JOIN `kategori` ON `katid`=`intel_katid`
LEFT JOIN `lokasi` ON `lokid`=`intel_lokid`
WHERE `intel_id` = '3'
---
    public function detailIntelijen($intel_id)
    {
        return $this->table('data_intilejen')
            ->join('kategori', 'katid=intel_katid', 'left')
            ->join('lokasi', 'lokid=intel_lokid', 'left')
            ->getWhere([
                'intel_id' => $intel_id
            ]);