gis/app/Models/ModelUser.php

    public function dataUser()
    {
        return $this->table('user')
            ->join('level', 'levelid=userlevel', 'left')
            ->get();
---
SELECT *
FROM `user`
LEFT JOIN `level` ON `levelid`=`userlevel`