gis/app/Models/ModelLevel.php

    public function dataLevel()
    {
        return $this->table('level')
            ->join('user', 'userlevel=levelid', 'left')
            ->get();
---
SELECT *
FROM `level`
LEFT JOIN `user` ON `userlevel`=`levelid`