bamboodimsum/app/Controllers/Home.php

SELECT *
FROM `menu`
---
    public function index(): string
    {
        $modelMenu = new ModelMenu();
        $data = [
            'dataMenu' => $modelMenu->findAll(),
        ];