bamboodimsum/app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `user`.`userid` = 'admin'
---
            } else {
                $modelUser  = new ModelUser();

                $cekUser = $modelUser->find($userid);