bamboodimsum/app/Controllers/Menu.php


                unlink('upload/' . $cekData['menufoto']);

                $modelMenu->update($menuid, [
                    'menunama'          => $menunama,
                    'menuharga'         => $menuharga,
                    'menudeskripsi'     => $menudeskripsi,
                    'menufoto'          => $menufoto->getName(),
                ]);
---
UPDATE `menu` SET `menunama` = 'asda', `menuharga` = '2342342,00', `menudeskripsi` = 'adsfads', `menufoto` = '1716860659_4e8eb05cc01a727d1439.jpg', `updated_at` = '2024-05-28 01:44:19'
WHERE `menu`.`menuid` IN ('2')