bamboodimsum/app/Controllers/Pesanan.php

SELECT *
FROM `menu`
WHERE `menu`.`menuid` = '3'
---
    function tambahKeranjang($menuid)
    {

        $modelMenu = new ModelMenu();
        $cekData = $modelMenu->find($menuid);